7767517
90 105
Input                    data                     0 1 data -23330=4,3,320,320,3 0=320 1=320 2=3
Convolution              0_22                     1 1 data 0_22_bn_relu -23330=4,3,160,160,16 0=16 1=3 3=2 4=1 5=1 6=432 9=1
ConvolutionDepthWise     1_31                     1 1 0_22_bn_relu 1_31_bn_relu -23330=4,3,160,160,16 0=16 1=3 4=1 5=1 6=144 7=16 9=1
Convolution              2_40                     1 1 1_31_bn_relu 2_40_bn -23330=4,3,160,160,8 0=8 1=1 5=1 6=128
Convolution              3_49                     1 1 2_40_bn 3_49_bn_relu -23330=4,3,160,160,48 0=48 1=1 5=1 6=384 9=1
ConvolutionDepthWise     4_58                     1 1 3_49_bn_relu 4_58_bn_relu -23330=4,3,80,80,48 0=48 1=3 3=2 4=1 5=1 6=432 7=48 9=1
Convolution              5_67                     1 1 4_58_bn_relu 5_67_bn -23330=4,3,80,80,12 0=12 1=1 5=1 6=576
Split                    5_67_bn_split            1 2 5_67_bn 5_67_bn_split_0 5_67_bn_split_1 -23330=8,3,80,80,12,3,80,80,12
Convolution              6_76                     1 1 5_67_bn_split_0 6_76_bn_relu -23330=4,3,80,80,72 0=72 1=1 5=1 6=864 9=1
ConvolutionDepthWise     7_85                     1 1 6_76_bn_relu 7_85_bn_relu -23330=4,3,80,80,72 0=72 1=3 4=1 5=1 6=648 7=72 9=1
Convolution              8_94                     1 1 7_85_bn_relu 8_94_bn -23330=4,3,80,80,12 0=12 1=1 5=1 6=864
Eltwise                  9_103                    2 1 8_94_bn 5_67_bn_split_1 9_103 -23330=4,3,80,80,12 0=1
Convolution              10_107                   1 1 9_103 10_107_bn_relu -23330=4,3,80,80,72 0=72 1=1 5=1 6=864 9=1
ConvolutionDepthWise     11_116                   1 1 10_107_bn_relu 11_116_bn_relu -23330=4,3,40,40,72 0=72 1=3 3=2 4=1 5=1 6=648 7=72 9=1
Convolution              12_125                   1 1 11_116_bn_relu 12_125_bn -23330=4,3,40,40,16 0=16 1=1 5=1 6=1152
Split                    12_125_bn_split          1 2 12_125_bn 12_125_bn_split_0 12_125_bn_split_1 -23330=8,3,40,40,16,3,40,40,16
Convolution              13_134                   1 1 12_125_bn_split_0 13_134_bn_relu -23330=4,3,40,40,96 0=96 1=1 5=1 6=1536 9=1
ConvolutionDepthWise     14_143                   1 1 13_134_bn_relu 14_143_bn_relu -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=864 7=96 9=1
Convolution              15_152                   1 1 14_143_bn_relu 15_152_bn -23330=4,3,40,40,16 0=16 1=1 5=1 6=1536
Eltwise                  16_161                   2 1 15_152_bn 12_125_bn_split_1 16_161 -23330=4,3,40,40,16 0=1
Split                    16_161_split             1 2 16_161 16_161_split_0 16_161_split_1 -23330=8,3,40,40,16,3,40,40,16
Convolution              17_165                   1 1 16_161_split_0 17_165_bn_relu -23330=4,3,40,40,96 0=96 1=1 5=1 6=1536 9=1
ConvolutionDepthWise     18_174                   1 1 17_165_bn_relu 18_174_bn_relu -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=864 7=96 9=1
Convolution              19_183                   1 1 18_174_bn_relu 19_183_bn -23330=4,3,40,40,16 0=16 1=1 5=1 6=1536
Eltwise                  20_192                   2 1 19_183_bn 16_161_split_1 20_192 -23330=4,3,40,40,16 0=1
Convolution              21_196                   1 1 20_192 21_196_bn_relu -23330=4,3,40,40,96 0=96 1=1 5=1 6=1536 9=1
ConvolutionDepthWise     22_205                   1 1 21_196_bn_relu 22_205_bn_relu -23330=4,3,20,20,96 0=96 1=3 3=2 4=1 5=1 6=864 7=96 9=1
Convolution              23_214                   1 1 22_205_bn_relu 23_214_bn -23330=4,3,20,20,32 0=32 1=1 5=1 6=3072
Split                    23_214_bn_split          1 2 23_214_bn 23_214_bn_split_0 23_214_bn_split_1 -23330=8,3,20,20,32,3,20,20,32
Convolution              24_223                   1 1 23_214_bn_split_0 24_223_bn_relu -23330=4,3,20,20,192 0=192 1=1 5=1 6=6144 9=1
ConvolutionDepthWise     25_232                   1 1 24_223_bn_relu 25_232_bn_relu -23330=4,3,20,20,192 0=192 1=3 4=1 5=1 6=1728 7=192 9=1
Convolution              26_241                   1 1 25_232_bn_relu 26_241_bn -23330=4,3,20,20,32 0=32 1=1 5=1 6=6144
Eltwise                  27_250                   2 1 26_241_bn 23_214_bn_split_1 27_250 -23330=4,3,20,20,32 0=1
Split                    27_250_split             1 2 27_250 27_250_split_0 27_250_split_1 -23330=8,3,20,20,32,3,20,20,32
Convolution              28_254                   1 1 27_250_split_0 28_254_bn_relu -23330=4,3,20,20,192 0=192 1=1 5=1 6=6144 9=1
ConvolutionDepthWise     29_263                   1 1 28_254_bn_relu 29_263_bn_relu -23330=4,3,20,20,192 0=192 1=3 4=1 5=1 6=1728 7=192 9=1
Convolution              30_272                   1 1 29_263_bn_relu 30_272_bn -23330=4,3,20,20,32 0=32 1=1 5=1 6=6144
Eltwise                  31_281                   2 1 30_272_bn 27_250_split_1 31_281 -23330=4,3,20,20,32 0=1
Split                    31_281_split             1 2 31_281 31_281_split_0 31_281_split_1 -23330=8,3,20,20,32,3,20,20,32
Convolution              32_285                   1 1 31_281_split_0 32_285_bn_relu -23330=4,3,20,20,192 0=192 1=1 5=1 6=6144 9=1
ConvolutionDepthWise     33_294                   1 1 32_285_bn_relu 33_294_bn_relu -23330=4,3,20,20,192 0=192 1=3 4=1 5=1 6=1728 7=192 9=1
Convolution              34_303                   1 1 33_294_bn_relu 34_303_bn -23330=4,3,20,20,32 0=32 1=1 5=1 6=6144
Eltwise                  35_312                   2 1 34_303_bn 31_281_split_1 35_312 -23330=4,3,20,20,32 0=1
Convolution              36_316                   1 1 35_312 36_316_bn_relu -23330=4,3,20,20,192 0=192 1=1 5=1 6=6144 9=1
ConvolutionDepthWise     37_325                   1 1 36_316_bn_relu 37_325_bn_relu -23330=4,3,20,20,192 0=192 1=3 4=1 5=1 6=1728 7=192 9=1
Convolution              38_334                   1 1 37_325_bn_relu 38_334_bn -23330=4,3,20,20,48 0=48 1=1 5=1 6=9216
Split                    38_334_bn_split          1 2 38_334_bn 38_334_bn_split_0 38_334_bn_split_1 -23330=8,3,20,20,48,3,20,20,48
Convolution              39_343                   1 1 38_334_bn_split_0 39_343_bn_relu -23330=4,3,20,20,288 0=288 1=1 5=1 6=13824 9=1
ConvolutionDepthWise     40_352                   1 1 39_343_bn_relu 40_352_bn_relu -23330=4,3,20,20,288 0=288 1=3 4=1 5=1 6=2592 7=288 9=1
Convolution              41_361                   1 1 40_352_bn_relu 41_361_bn -23330=4,3,20,20,48 0=48 1=1 5=1 6=13824
Eltwise                  42_370                   2 1 41_361_bn 38_334_bn_split_1 42_370 -23330=4,3,20,20,48 0=1
Split                    42_370_split             1 2 42_370 42_370_split_0 42_370_split_1 -23330=8,3,20,20,48,3,20,20,48
Convolution              43_374                   1 1 42_370_split_0 43_374_bn_relu -23330=4,3,20,20,288 0=288 1=1 5=1 6=13824 9=1
ConvolutionDepthWise     44_383                   1 1 43_374_bn_relu 44_383_bn_relu -23330=4,3,20,20,288 0=288 1=3 4=1 5=1 6=2592 7=288 9=1
Convolution              45_392                   1 1 44_383_bn_relu 45_392_bn -23330=4,3,20,20,48 0=48 1=1 5=1 6=13824
Eltwise                  46_401                   2 1 45_392_bn 42_370_split_1 46_401 -23330=4,3,20,20,48 0=1
Convolution              47_405                   1 1 46_401 47_405_bn_relu -23330=4,3,20,20,288 0=288 1=1 5=1 6=13824 9=1
Split                    47_405_bn_relu_split     1 2 47_405_bn_relu 47_405_bn_relu_split_0 47_405_bn_relu_split_1 -23330=8,3,20,20,288,3,20,20,288
ConvolutionDepthWise     48_414                   1 1 47_405_bn_relu_split_0 48_414_bn_relu -23330=4,3,10,10,288 0=288 1=3 3=2 4=1 5=1 6=2592 7=288 9=1
Convolution              49_423                   1 1 48_414_bn_relu 49_423_bn -23330=4,3,10,10,80 0=80 1=1 5=1 6=23040
Split                    49_423_bn_split          1 2 49_423_bn 49_423_bn_split_0 49_423_bn_split_1 -23330=8,3,10,10,80,3,10,10,80
Convolution              50_432                   1 1 49_423_bn_split_0 50_432_bn_relu -23330=4,3,10,10,480 0=480 1=1 5=1 6=38400 9=1
ConvolutionDepthWise     51_441                   1 1 50_432_bn_relu 51_441_bn_relu -23330=4,3,10,10,480 0=480 1=3 4=1 5=1 6=4320 7=480 9=1
Convolution              52_450                   1 1 51_441_bn_relu 52_450_bn -23330=4,3,10,10,80 0=80 1=1 5=1 6=38400
Eltwise                  53_459                   2 1 52_450_bn 49_423_bn_split_1 53_459 -23330=4,3,10,10,80 0=1
Split                    53_459_split             1 2 53_459 53_459_split_0 53_459_split_1 -23330=8,3,10,10,80,3,10,10,80
Convolution              54_463                   1 1 53_459_split_0 54_463_bn_relu -23330=4,3,10,10,480 0=480 1=1 5=1 6=38400 9=1
ConvolutionDepthWise     55_472                   1 1 54_463_bn_relu 55_472_bn_relu -23330=4,3,10,10,480 0=480 1=3 4=1 5=1 6=4320 7=480 9=1
Convolution              56_481                   1 1 55_472_bn_relu 56_481_bn -23330=4,3,10,10,80 0=80 1=1 5=1 6=38400
Eltwise                  57_490                   2 1 56_481_bn 53_459_split_1 57_490 -23330=4,3,10,10,80 0=1
Split                    57_490_split             1 4 57_490 57_490_split_0 57_490_split_1 57_490_split_2 57_490_split_3 -23330=16,3,10,10,80,3,10,10,80,3,10,10,80,3,10,10,80
Pooling                  58_494                   1 1 57_490_split_0 58_494 -23330=4,3,10,10,80 1=3 14=2 15=2 5=1
Pooling                  60_501                   1 1 57_490_split_1 60_501 -23330=4,3,10,10,80 1=5 14=4 15=4 5=1
Pooling                  62_508                   1 1 57_490_split_2 62_508 -23330=4,3,10,10,80 1=9 14=8 15=8 5=1
Concat                   63_512                   4 1 62_508 60_501 58_494 57_490_split_3 63_512 -23330=4,3,10,10,320
Convolution              64_517                   1 1 63_512 64_517_bn_relu -23330=4,3,10,10,288 0=288 1=1 5=1 6=92160 9=1
Split                    64_517_bn_relu_split     1 2 64_517_bn_relu 64_517_bn_relu_split_0 64_517_bn_relu_split_1 -23330=8,3,10,10,288,3,10,10,288
ConvolutionDepthWise     65_525                   1 1 64_517_bn_relu_split_0 65_525_bn_relu -23330=4,3,10,10,288 0=288 1=3 4=1 5=1 6=2592 7=288 9=1
Convolution              66_534                   1 1 65_525_bn_relu 66_534_bn_relu -23330=4,3,10,10,96 0=96 1=1 5=1 6=27648 9=1
Convolution              67_542                   1 1 66_534_bn_relu 67_542_bn_relu -23330=4,3,10,10,384 0=384 1=1 5=1 6=36864 9=1
Convolution              68_550                   1 1 67_542_bn_relu 68_550 -23330=4,3,10,10,255 0=255 1=1 5=1 6=97920
Interp                   71_580                   1 1 64_517_bn_relu_split_1 71_580 -23330=4,3,20,20,288 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   72_583                   2 1 71_580 47_405_bn_relu_split_1 72_583 -23330=4,3,20,20,576
Convolution              73_586                   1 1 72_583 73_586_bn_relu -23330=4,3,20,20,80 0=80 1=1 5=1 6=46080 9=1
Convolution              74_595                   1 1 73_586_bn_relu 74_595_bn_relu -23330=4,3,20,20,288 0=288 1=1 5=1 6=23040 9=1
ConvolutionDepthWise     75_603                   1 1 74_595_bn_relu 75_603_bn_relu -23330=4,3,20,20,288 0=288 1=3 4=1 5=1 6=2592 7=288 9=1
Convolution              76_612                   1 1 75_603_bn_relu 76_612_bn_relu -23330=4,3,20,20,192 0=192 1=1 5=1 6=55296 9=1
Convolution              77_620                   1 1 76_612_bn_relu 77_620_bn_relu -23330=4,3,20,20,288 0=288 1=1 5=1 6=55296 9=1
Convolution              78_628                   1 1 77_620_bn_relu 78_628 -23330=4,3,20,20,255 0=255 1=1 5=1 6=73440
Yolov3DetectionOutput    detection_out            2 1 68_550 78_628 output -23330=4,2,6,1356,1 0=80 1=3 2=0.24 -23304=12,1.200000e+01,1.800000e+01,3.700000e+01,4.900000e+01,5.200000e+01,1.320000e+02,1.150000e+02,7.400000e+01,1.190000e+02,1.990000e+02,2.430000e+02,2.380000e+02 -23305=6,1077936128,1082130432,1084227584,0,1065353216,1073741824 -23306=2,3.520000e+01,1.680000e+01
