7767517
207 225
Input            0                        0 1 0
Convolution      346                      1 1 0 346 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=432
BatchNorm        347                      1 1 346 347 0=16
ReLU             348                      1 1 347 348
Convolution      349                      1 1 348 349 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=256
BatchNorm        350                      1 1 349 350 0=16
ReLU             351                      1 1 350 351
ConvolutionDepthWise 352                      1 1 351 352 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        353                      1 1 352 353 0=16
ReLU             354                      1 1 353 354
Convolution      355                      1 1 354 355 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=256
BatchNorm        356                      1 1 355 356 0=16
Split            splitncnn_0              1 2 356 356_splitncnn_0 356_splitncnn_1
Convolution      357                      1 1 356_splitncnn_1 357 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1152
BatchNorm        358                      1 1 357 358 0=72
ReLU             359                      1 1 358 359
ConvolutionDepthWise 360                      1 1 359 360 0=72 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=648 7=72
BatchNorm        361                      1 1 360 361 0=72
ReLU             362                      1 1 361 362
Convolution      363                      1 1 362 363 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1728
BatchNorm        364                      1 1 363 364 0=24
Split            splitncnn_1              1 2 364 364_splitncnn_0 364_splitncnn_1
Convolution      365                      1 1 364_splitncnn_1 365 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2112
BatchNorm        366                      1 1 365 366 0=88
ReLU             367                      1 1 366 367
ConvolutionDepthWise 368                      1 1 367 368 0=88 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=792 7=88
BatchNorm        369                      1 1 368 369 0=88
ReLU             370                      1 1 369 370
Convolution      371                      1 1 370 371 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2112
BatchNorm        372                      1 1 371 372 0=24
BinaryOp         373                      2 1 372 364_splitncnn_0 373 0=0
Split            splitncnn_2              1 2 373 373_splitncnn_0 373_splitncnn_1
Convolution      374                      1 1 373_splitncnn_1 374 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        375                      1 1 374 375 0=96
ReLU             376                      1 1 375 376
ConvolutionDepthWise 377                      1 1 376 377 0=96 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=2400 7=96
BatchNorm        378                      1 1 377 378 0=96
ReLU             379                      1 1 378 379
Convolution      380                      1 1 379 380 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3840
BatchNorm        381                      1 1 380 381 0=40
Split            splitncnn_3              1 2 381 381_splitncnn_0 381_splitncnn_1
Pooling          382                      1 1 381_splitncnn_1 382 0=1 4=1
Convolution      383                      1 1 382 383 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        384                      1 1 383 384 0=10
ReLU             385                      1 1 384 385
Convolution      386                      1 1 385 386 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        387                      1 1 386 387 0=40
Sigmoid          388                      1 1 387 388
BinaryOp         389                      2 1 381_splitncnn_0 388 389 0=2
Split            splitncnn_4              1 2 389 389_splitncnn_0 389_splitncnn_1
Convolution      390                      1 1 389_splitncnn_1 390 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=9600
BatchNorm        391                      1 1 390 391 0=240
ReLU             392                      1 1 391 392
ConvolutionDepthWise 393                      1 1 392 393 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=6000 7=240
BatchNorm        394                      1 1 393 394 0=240
ReLU             395                      1 1 394 395
Convolution      396                      1 1 395 396 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=9600
BatchNorm        397                      1 1 396 397 0=40
Split            splitncnn_5              1 2 397 397_splitncnn_0 397_splitncnn_1
Pooling          398                      1 1 397_splitncnn_1 398 0=1 4=1
Convolution      399                      1 1 398 399 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        400                      1 1 399 400 0=10
ReLU             401                      1 1 400 401
Convolution      402                      1 1 401 402 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        403                      1 1 402 403 0=40
Sigmoid          404                      1 1 403 404
BinaryOp         405                      2 1 397_splitncnn_0 404 405 0=2
BinaryOp         406                      2 1 405 389_splitncnn_0 406 0=0
Split            splitncnn_6              1 2 406 406_splitncnn_0 406_splitncnn_1
Convolution      407                      1 1 406_splitncnn_1 407 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=9600
BatchNorm        408                      1 1 407 408 0=240
ReLU             409                      1 1 408 409
ConvolutionDepthWise 410                      1 1 409 410 0=240 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=6000 7=240
BatchNorm        411                      1 1 410 411 0=240
ReLU             412                      1 1 411 412
Convolution      413                      1 1 412 413 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=9600
BatchNorm        414                      1 1 413 414 0=40
Split            splitncnn_7              1 2 414 414_splitncnn_0 414_splitncnn_1
Pooling          415                      1 1 414_splitncnn_1 415 0=1 4=1
Convolution      416                      1 1 415 416 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        417                      1 1 416 417 0=10
ReLU             418                      1 1 417 418
Convolution      419                      1 1 418 419 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=400
BatchNorm        420                      1 1 419 420 0=40
Sigmoid          421                      1 1 420 421
BinaryOp         422                      2 1 414_splitncnn_0 421 422 0=2
BinaryOp         423                      2 1 422 406_splitncnn_0 423 0=0
Split            splitncnn_8              1 2 423 423_splitncnn_0 423_splitncnn_1
Convolution      424                      1 1 423_splitncnn_1 424 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4800
BatchNorm        425                      1 1 424 425 0=120
ReLU             426                      1 1 425 426
ConvolutionDepthWise 427                      1 1 426 427 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3000 7=120
BatchNorm        428                      1 1 427 428 0=120
ReLU             429                      1 1 428 429
Convolution      430                      1 1 429 430 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=5760
BatchNorm        431                      1 1 430 431 0=48
Split            splitncnn_9              1 2 431 431_splitncnn_0 431_splitncnn_1
Pooling          432                      1 1 431_splitncnn_1 432 0=1 4=1
Convolution      433                      1 1 432 433 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        434                      1 1 433 434 0=12
ReLU             435                      1 1 434 435
Convolution      436                      1 1 435 436 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        437                      1 1 436 437 0=48
Sigmoid          438                      1 1 437 438
BinaryOp         439                      2 1 431_splitncnn_0 438 439 0=2
Convolution      440                      1 1 423_splitncnn_0 440 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1920
BatchNorm        441                      1 1 440 441 0=48
BinaryOp         442                      2 1 439 441 442 0=0
Split            splitncnn_10             1 2 442 442_splitncnn_0 442_splitncnn_1
Convolution      443                      1 1 442_splitncnn_1 443 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6912
BatchNorm        444                      1 1 443 444 0=144
ReLU             445                      1 1 444 445
ConvolutionDepthWise 446                      1 1 445 446 0=144 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=3600 7=144
BatchNorm        447                      1 1 446 447 0=144
ReLU             448                      1 1 447 448
Convolution      449                      1 1 448 449 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6912
BatchNorm        450                      1 1 449 450 0=48
Split            splitncnn_11             1 2 450 450_splitncnn_0 450_splitncnn_1
Pooling          451                      1 1 450_splitncnn_1 451 0=1 4=1
Convolution      452                      1 1 451 452 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        453                      1 1 452 453 0=12
ReLU             454                      1 1 453 454
Convolution      455                      1 1 454 455 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=576
BatchNorm        456                      1 1 455 456 0=48
Sigmoid          457                      1 1 456 457
BinaryOp         458                      2 1 450_splitncnn_0 457 458 0=2
BinaryOp         459                      2 1 458 442_splitncnn_0 459 0=0
Split            splitncnn_12             1 2 459 459_splitncnn_0 459_splitncnn_1
Convolution      460                      1 1 459_splitncnn_1 460 0=288 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=13824
BatchNorm        461                      1 1 460 461 0=288
ReLU             462                      1 1 461 462
ConvolutionDepthWise 463                      1 1 462 463 0=288 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=0 6=7200 7=288
BatchNorm        464                      1 1 463 464 0=288
ReLU             465                      1 1 464 465
Convolution      466                      1 1 465 466 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=27648
BatchNorm        467                      1 1 466 467 0=96
Split            splitncnn_13             1 2 467 467_splitncnn_0 467_splitncnn_1
Pooling          468                      1 1 467_splitncnn_1 468 0=1 4=1
Convolution      469                      1 1 468 469 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        470                      1 1 469 470 0=24
ReLU             471                      1 1 470 471
Convolution      472                      1 1 471 472 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2304
BatchNorm        473                      1 1 472 473 0=96
Sigmoid          474                      1 1 473 474
BinaryOp         475                      2 1 467_splitncnn_0 474 475 0=2
Convolution      476                      1 1 475 476 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=6144
BatchNorm        477                      1 1 476 477 0=64
ReLU             478                      1 1 477 478
Deconvolution    479                      1 1 478 479 0=64 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=16384
Convolution      480                      1 1 479 480 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        481                      1 1 480 481 0=64
ReLU             482                      1 1 481 482
Convolution      483                      1 1 459_splitncnn_0 483 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3072
BatchNorm        484                      1 1 483 484 0=64
ReLU             485                      1 1 484 485
BinaryOp         486                      2 1 482 485 486 0=0
Deconvolution    487                      1 1 486 487 0=64 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=16384
Convolution      488                      1 1 487 488 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        489                      1 1 488 489 0=64
ReLU             490                      1 1 489 490
Convolution      491                      1 1 373_splitncnn_0 491 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1536
BatchNorm        492                      1 1 491 492 0=64
ReLU             493                      1 1 492 493
BinaryOp         494                      2 1 490 493 494 0=0
Deconvolution    495                      1 1 494 495 0=64 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=0 6=16384
Convolution      496                      1 1 495 496 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        497                      1 1 496 497 0=64
ReLU             498                      1 1 497 498
Convolution      499                      1 1 356_splitncnn_0 499 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        500                      1 1 499 500 0=64
ReLU             501                      1 1 500 501
BinaryOp         502                      2 1 498 501 502 0=0
Split            splitncnn_14             1 2 502 502_splitncnn_0 502_splitncnn_1
Convolution      503                      1 1 502_splitncnn_1 503 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=18432
BatchNorm        504                      1 1 503 504 0=32
ReLU             505                      1 1 504 505
Convolution      506                      1 1 502_splitncnn_0 506 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=9216
BatchNorm        507                      1 1 506 507 0=16
ReLU             508                      1 1 507 508
Split            splitncnn_15             1 2 508 508_splitncnn_0 508_splitncnn_1
Convolution      509                      1 1 508_splitncnn_1 509 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        510                      1 1 509 510 0=16
ReLU             511                      1 1 510 511
Convolution      512                      1 1 508_splitncnn_0 512 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        513                      1 1 512 513 0=16
ReLU             514                      1 1 513 514
Convolution      515                      1 1 514 515 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304
BatchNorm        516                      1 1 515 516 0=16
ReLU             517                      1 1 516 517
Concat           518                      2 1 511 517 518 0=0
Concat           519                      2 1 505 518 519 0=0
Split            splitncnn_16             1 3 519 519_splitncnn_0 519_splitncnn_1 519_splitncnn_2
Convolution      520                      1 1 519_splitncnn_2 520 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        521                      1 1 520 521 0=64
ReLU             522                      1 1 521 522
Convolution      523                      1 1 522 523 0=1 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=64
Convolution      524                      1 1 519_splitncnn_1 524 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        525                      1 1 524 525 0=64
ReLU             526                      1 1 525 526
Convolution      527                      1 1 526 527 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Sigmoid          hm                       1 1 523 hm
UnaryOp          tlrb                     1 1 527 tlrb 0=7
Convolution      530                      1 1 519_splitncnn_0 530 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=36864
BatchNorm        531                      1 1 530 531 0=64
ReLU             532                      1 1 531 532
Convolution      landmark                 1 1 532 landmark 0=10 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=640
Pooling          pool_hm                  1 1 hm pool_hm 0=0 1=3 11=3 2=1 12=1 3=1 13=1 14=1 15=1 5=1
