7767517
153 178
Input                    input.1                  0 1 input.1 -23330=4,3,320,320,3 0=320 1=320 2=3
Convolution              Conv_0                   1 1 input.1 424 -23330=4,3,160,160,24 0=24 1=3 3=2 4=1 5=1 6=648 9=2 -23310=1,1.000000e-01
Pooling                  MaxPool_3                1 1 424 425 -23330=4,3,80,80,24 1=3 2=2 3=1 5=1
Split                    splitncnn_0              1 2 425 425_splitncnn_0 425_splitncnn_1 -23330=8,3,80,80,24,3,80,80,24
ConvolutionDepthWise     Conv_4                   1 1 425_splitncnn_1 427 -23330=4,3,40,40,24 0=24 1=3 3=2 4=1 5=1 6=216 7=24
Convolution              Conv_6                   1 1 427 430 -23330=4,3,40,40,58 0=58 1=1 5=1 6=1392 9=2 -23310=1,1.000000e-01
Convolution              Conv_9                   1 1 425_splitncnn_0 433 -23330=4,3,80,80,58 0=58 1=1 5=1 6=1392 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_12                  1 1 433 435 -23330=4,3,40,40,58 0=58 1=3 3=2 4=1 5=1 6=522 7=58
Convolution              Conv_14                  1 1 435 438 -23330=4,3,40,40,58 0=58 1=1 5=1 6=3364 9=2 -23310=1,1.000000e-01
Concat                   Concat_17                2 1 430 438 439 -23330=4,3,40,40,116
ShuffleChannel           Reshape_22               1 1 439 444 -23330=4,3,40,40,116 0=2
Slice                    Split_23                 1 2 444 445 446 -23330=8,3,40,40,58,3,40,40,58 -23300=2,58,-233
Convolution              Conv_24                  1 1 446 449 -23330=4,3,40,40,58 0=58 1=1 5=1 6=3364 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_27                  1 1 449 451 -23330=4,3,40,40,58 0=58 1=3 4=1 5=1 6=522 7=58
Convolution              Conv_29                  1 1 451 454 -23330=4,3,40,40,58 0=58 1=1 5=1 6=3364 9=2 -23310=1,1.000000e-01
Concat                   Concat_32                2 1 445 454 455 -23330=4,3,40,40,116
ShuffleChannel           Reshape_37               1 1 455 460 -23330=4,3,40,40,116 0=2
Slice                    Split_38                 1 2 460 461 462 -23330=8,3,40,40,58,3,40,40,58 -23300=2,58,-233
Convolution              Conv_39                  1 1 462 465 -23330=4,3,40,40,58 0=58 1=1 5=1 6=3364 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_42                  1 1 465 467 -23330=4,3,40,40,58 0=58 1=3 4=1 5=1 6=522 7=58
Convolution              Conv_44                  1 1 467 470 -23330=4,3,40,40,58 0=58 1=1 5=1 6=3364 9=2 -23310=1,1.000000e-01
Concat                   Concat_47                2 1 461 470 471 -23330=4,3,40,40,116
ShuffleChannel           Reshape_52               1 1 471 476 -23330=4,3,40,40,116 0=2
Slice                    Split_53                 1 2 476 477 478 -23330=8,3,40,40,58,3,40,40,58 -23300=2,58,-233
Convolution              Conv_54                  1 1 478 481 -23330=4,3,40,40,58 0=58 1=1 5=1 6=3364 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_57                  1 1 481 483 -23330=4,3,40,40,58 0=58 1=3 4=1 5=1 6=522 7=58
Convolution              Conv_59                  1 1 483 486 -23330=4,3,40,40,58 0=58 1=1 5=1 6=3364 9=2 -23310=1,1.000000e-01
Concat                   Concat_62                2 1 477 486 487 -23330=4,3,40,40,116
ShuffleChannel           Reshape_67               1 1 487 492 -23330=4,3,40,40,116 0=2
Split                    splitncnn_1              1 3 492 492_splitncnn_0 492_splitncnn_1 492_splitncnn_2 -23330=12,3,40,40,116,3,40,40,116,3,40,40,116
ConvolutionDepthWise     Conv_68                  1 1 492_splitncnn_2 494 -23330=4,3,20,20,116 0=116 1=3 3=2 4=1 5=1 6=1044 7=116
Convolution              Conv_70                  1 1 494 497 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
Convolution              Conv_73                  1 1 492_splitncnn_1 500 -23330=4,3,40,40,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_76                  1 1 500 502 -23330=4,3,20,20,116 0=116 1=3 3=2 4=1 5=1 6=1044 7=116
Convolution              Conv_78                  1 1 502 505 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
Concat                   Concat_81                2 1 497 505 506 -23330=4,3,20,20,232
ShuffleChannel           Reshape_86               1 1 506 511 -23330=4,3,20,20,232 0=2
Slice                    Split_87                 1 2 511 512 513 -23330=8,3,20,20,116,3,20,20,116 -23300=2,116,-233
Convolution              Conv_88                  1 1 513 516 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_91                  1 1 516 518 -23330=4,3,20,20,116 0=116 1=3 4=1 5=1 6=1044 7=116
Convolution              Conv_93                  1 1 518 521 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
Concat                   Concat_96                2 1 512 521 522 -23330=4,3,20,20,232
ShuffleChannel           Reshape_101              1 1 522 527 -23330=4,3,20,20,232 0=2
Slice                    Split_102                1 2 527 528 529 -23330=8,3,20,20,116,3,20,20,116 -23300=2,116,-233
Convolution              Conv_103                 1 1 529 532 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_106                 1 1 532 534 -23330=4,3,20,20,116 0=116 1=3 4=1 5=1 6=1044 7=116
Convolution              Conv_108                 1 1 534 537 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
Concat                   Concat_111               2 1 528 537 538 -23330=4,3,20,20,232
ShuffleChannel           Reshape_116              1 1 538 543 -23330=4,3,20,20,232 0=2
Slice                    Split_117                1 2 543 544 545 -23330=8,3,20,20,116,3,20,20,116 -23300=2,116,-233
Convolution              Conv_118                 1 1 545 548 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_121                 1 1 548 550 -23330=4,3,20,20,116 0=116 1=3 4=1 5=1 6=1044 7=116
Convolution              Conv_123                 1 1 550 553 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
Concat                   Concat_126               2 1 544 553 554 -23330=4,3,20,20,232
ShuffleChannel           Reshape_131              1 1 554 559 -23330=4,3,20,20,232 0=2
Slice                    Split_132                1 2 559 560 561 -23330=8,3,20,20,116,3,20,20,116 -23300=2,116,-233
Convolution              Conv_133                 1 1 561 564 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_136                 1 1 564 566 -23330=4,3,20,20,116 0=116 1=3 4=1 5=1 6=1044 7=116
Convolution              Conv_138                 1 1 566 569 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
Concat                   Concat_141               2 1 560 569 570 -23330=4,3,20,20,232
ShuffleChannel           Reshape_146              1 1 570 575 -23330=4,3,20,20,232 0=2
Slice                    Split_147                1 2 575 576 577 -23330=8,3,20,20,116,3,20,20,116 -23300=2,116,-233
Convolution              Conv_148                 1 1 577 580 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_151                 1 1 580 582 -23330=4,3,20,20,116 0=116 1=3 4=1 5=1 6=1044 7=116
Convolution              Conv_153                 1 1 582 585 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
Concat                   Concat_156               2 1 576 585 586 -23330=4,3,20,20,232
ShuffleChannel           Reshape_161              1 1 586 591 -23330=4,3,20,20,232 0=2
Slice                    Split_162                1 2 591 592 593 -23330=8,3,20,20,116,3,20,20,116 -23300=2,116,-233
Convolution              Conv_163                 1 1 593 596 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_166                 1 1 596 598 -23330=4,3,20,20,116 0=116 1=3 4=1 5=1 6=1044 7=116
Convolution              Conv_168                 1 1 598 601 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
Concat                   Concat_171               2 1 592 601 602 -23330=4,3,20,20,232
ShuffleChannel           Reshape_176              1 1 602 607 -23330=4,3,20,20,232 0=2
Slice                    Split_177                1 2 607 608 609 -23330=8,3,20,20,116,3,20,20,116 -23300=2,116,-233
Convolution              Conv_178                 1 1 609 612 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_181                 1 1 612 614 -23330=4,3,20,20,116 0=116 1=3 4=1 5=1 6=1044 7=116
Convolution              Conv_183                 1 1 614 617 -23330=4,3,20,20,116 0=116 1=1 5=1 6=13456 9=2 -23310=1,1.000000e-01
Concat                   Concat_186               2 1 608 617 618 -23330=4,3,20,20,232
ShuffleChannel           Reshape_191              1 1 618 623 -23330=4,3,20,20,232 0=2
Split                    splitncnn_2              1 3 623 623_splitncnn_0 623_splitncnn_1 623_splitncnn_2 -23330=12,3,20,20,232,3,20,20,232,3,20,20,232
ConvolutionDepthWise     Conv_192                 1 1 623_splitncnn_2 625 -23330=4,3,10,10,232 0=232 1=3 3=2 4=1 5=1 6=2088 7=232
Convolution              Conv_194                 1 1 625 628 -23330=4,3,10,10,232 0=232 1=1 5=1 6=53824 9=2 -23310=1,1.000000e-01
Convolution              Conv_197                 1 1 623_splitncnn_1 631 -23330=4,3,20,20,232 0=232 1=1 5=1 6=53824 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_200                 1 1 631 633 -23330=4,3,10,10,232 0=232 1=3 3=2 4=1 5=1 6=2088 7=232
Convolution              Conv_202                 1 1 633 636 -23330=4,3,10,10,232 0=232 1=1 5=1 6=53824 9=2 -23310=1,1.000000e-01
Concat                   Concat_205               2 1 628 636 637 -23330=4,3,10,10,464
ShuffleChannel           Reshape_210              1 1 637 642 -23330=4,3,10,10,464 0=2
Slice                    Split_211                1 2 642 643 644 -23330=8,3,10,10,232,3,10,10,232 -23300=2,232,-233
Convolution              Conv_212                 1 1 644 647 -23330=4,3,10,10,232 0=232 1=1 5=1 6=53824 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_215                 1 1 647 649 -23330=4,3,10,10,232 0=232 1=3 4=1 5=1 6=2088 7=232
Convolution              Conv_217                 1 1 649 652 -23330=4,3,10,10,232 0=232 1=1 5=1 6=53824 9=2 -23310=1,1.000000e-01
Concat                   Concat_220               2 1 643 652 653 -23330=4,3,10,10,464
ShuffleChannel           Reshape_225              1 1 653 658 -23330=4,3,10,10,464 0=2
Slice                    Split_226                1 2 658 659 660 -23330=8,3,10,10,232,3,10,10,232 -23300=2,232,-233
Convolution              Conv_227                 1 1 660 663 -23330=4,3,10,10,232 0=232 1=1 5=1 6=53824 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_230                 1 1 663 665 -23330=4,3,10,10,232 0=232 1=3 4=1 5=1 6=2088 7=232
Convolution              Conv_232                 1 1 665 668 -23330=4,3,10,10,232 0=232 1=1 5=1 6=53824 9=2 -23310=1,1.000000e-01
Concat                   Concat_235               2 1 659 668 669 -23330=4,3,10,10,464
ShuffleChannel           Reshape_240              1 1 669 674 -23330=4,3,10,10,464 0=2
Slice                    Split_241                1 2 674 675 676 -23330=8,3,10,10,232,3,10,10,232 -23300=2,232,-233
Convolution              Conv_242                 1 1 676 679 -23330=4,3,10,10,232 0=232 1=1 5=1 6=53824 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_245                 1 1 679 681 -23330=4,3,10,10,232 0=232 1=3 4=1 5=1 6=2088 7=232
Convolution              Conv_247                 1 1 681 684 -23330=4,3,10,10,232 0=232 1=1 5=1 6=53824 9=2 -23310=1,1.000000e-01
Concat                   Concat_250               2 1 675 684 685 -23330=4,3,10,10,464
ShuffleChannel           Reshape_255              1 1 685 690 -23330=4,3,10,10,464 0=2
Convolution              Conv_256                 1 1 492_splitncnn_0 691 -23330=4,3,40,40,96 0=96 1=1 5=1 6=11136
Convolution              Conv_257                 1 1 623_splitncnn_0 692 -23330=4,3,20,20,96 0=96 1=1 5=1 6=22272
Convolution              Conv_258                 1 1 690 693 -23330=4,3,10,10,96 0=96 1=1 5=1 6=44544
Split                    splitncnn_3              1 2 693 693_splitncnn_0 693_splitncnn_1 -23330=8,3,10,10,96,3,10,10,96
Interp                   Resize_277               1 1 693_splitncnn_1 712 -23330=4,3,20,20,96 0=2 3=20 4=20
BinaryOp                 Add_278                  2 1 692 712 713 -23330=4,3,20,20,96
Split                    splitncnn_4              1 2 713 713_splitncnn_0 713_splitncnn_1 -23330=8,3,20,20,96,3,20,20,96
Interp                   Resize_297               1 1 713_splitncnn_1 732 -23330=4,3,40,40,96 0=2 3=40 4=40
BinaryOp                 Add_298                  2 1 691 732 733 -23330=4,3,40,40,96
Split                    splitncnn_5              1 2 733 733_splitncnn_0 733_splitncnn_1 -23330=8,3,40,40,96,3,40,40,96
Interp                   Resize_317               1 1 733_splitncnn_1 752 -23330=4,3,20,20,96 0=2 3=20 4=20
BinaryOp                 Add_318                  2 1 713_splitncnn_0 752 753 -23330=4,3,20,20,96
Split                    splitncnn_6              1 2 753 753_splitncnn_0 753_splitncnn_1 -23330=8,3,20,20,96,3,20,20,96
Interp                   Resize_337               1 1 753_splitncnn_1 772 -23330=4,3,10,10,96 0=2 3=10 4=10
BinaryOp                 Add_338                  2 1 693_splitncnn_0 772 773 -23330=4,3,10,10,96
ConvolutionDepthWise     Conv_339                 1 1 733_splitncnn_0 776 -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=864 7=96 9=2 -23310=1,1.000000e-01
Convolution              Conv_342                 1 1 776 779 -23330=4,3,40,40,96 0=96 1=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_345                 1 1 779 782 -23330=4,3,40,40,96 0=96 1=3 4=1 5=1 6=864 7=96 9=2 -23310=1,1.000000e-01
Convolution              Conv_348                 1 1 782 785 -23330=4,3,40,40,96 0=96 1=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
Convolution              Conv_351                 1 1 785 786 -23330=4,3,40,40,112 0=112 1=1 5=1 6=10752
Slice                    Split_352                1 2 786 787 788 -23330=8,3,40,40,80,3,40,40,32 -23300=2,80,-233
Sigmoid                  Sigmoid_353              1 1 787 789 -23330=4,3,40,40,80
Reshape                  Reshape_355              1 1 789 791 -23330=4,2,1600,80,1 0=-1 1=80
Permute                  Transpose_356            1 1 791 792 -23330=4,2,80,1600,1 0=1
Reshape                  Reshape_358              1 1 788 794 -23330=4,2,1600,32,1 0=-1 1=32
Permute                  Transpose_359            1 1 794 795 -23330=4,2,32,1600,1 0=1
ConvolutionDepthWise     Conv_360                 1 1 753_splitncnn_0 798 -23330=4,3,20,20,96 0=96 1=3 4=1 5=1 6=864 7=96 9=2 -23310=1,1.000000e-01
Convolution              Conv_363                 1 1 798 801 -23330=4,3,20,20,96 0=96 1=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_366                 1 1 801 804 -23330=4,3,20,20,96 0=96 1=3 4=1 5=1 6=864 7=96 9=2 -23310=1,1.000000e-01
Convolution              Conv_369                 1 1 804 807 -23330=4,3,20,20,96 0=96 1=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
Convolution              Conv_372                 1 1 807 808 -23330=4,3,20,20,112 0=112 1=1 5=1 6=10752
Slice                    Split_373                1 2 808 809 810 -23330=8,3,20,20,80,3,20,20,32 -23300=2,80,-233
Sigmoid                  Sigmoid_374              1 1 809 811 -23330=4,3,20,20,80
Reshape                  Reshape_376              1 1 811 813 -23330=4,2,400,80,1 0=-1 1=80
Permute                  Transpose_377            1 1 813 814 -23330=4,2,80,400,1 0=1
Reshape                  Reshape_379              1 1 810 816 -23330=4,2,400,32,1 0=-1 1=32
Permute                  Transpose_380            1 1 816 817 -23330=4,2,32,400,1 0=1
ConvolutionDepthWise     Conv_381                 1 1 773 820 -23330=4,3,10,10,96 0=96 1=3 4=1 5=1 6=864 7=96 9=2 -23310=1,1.000000e-01
Convolution              Conv_384                 1 1 820 823 -23330=4,3,10,10,96 0=96 1=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     Conv_387                 1 1 823 826 -23330=4,3,10,10,96 0=96 1=3 4=1 5=1 6=864 7=96 9=2 -23310=1,1.000000e-01
Convolution              Conv_390                 1 1 826 829 -23330=4,3,10,10,96 0=96 1=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
Convolution              Conv_393                 1 1 829 830 -23330=4,3,10,10,112 0=112 1=1 5=1 6=10752
Slice                    Split_394                1 2 830 831 832 -23330=8,3,10,10,80,3,10,10,32 -23300=2,80,-233
Sigmoid                  Sigmoid_395              1 1 831 833 -23330=4,3,10,10,80
Reshape                  Reshape_397              1 1 833 835 -23330=4,2,100,80,1 0=-1 1=80
Permute                  Transpose_398            1 1 835 836 -23330=4,2,80,100,1 0=1
Reshape                  Reshape_400              1 1 832 838 -23330=4,2,100,32,1 0=-1 1=32
Permute                  Transpose_401            1 1 838 839 -23330=4,2,32,100,1 0=1
