7767517
80 90
Input                    data                     0 1 data
Convolution              mobilenetv20_features_conv0_fwd 1 1 data mobilenetv20_features_relu60_relu6 0=16 1=3 3=2 4=1 5=1 6=432 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck0_conv0_fwd 1 1 mobilenetv20_features_relu60_relu6 mobilenetv20_features_linearbottleneck0_relu60_relu6 0=16 1=3 4=1 5=1 6=144 7=16 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck0_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck0_relu60_relu6 mobilenetv20_features_linearbottleneck0_batchnormcudnnoff1_fwd 0=8 1=1 5=1 6=128
Convolution              mobilenetv20_features_linearbottleneck1_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck0_batchnormcudnnoff1_fwd mobilenetv20_features_linearbottleneck1_relu60_relu6 0=48 1=1 5=1 6=384 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck1_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck1_relu60_relu6 mobilenetv20_features_linearbottleneck1_relu61_relu6 0=48 1=3 3=2 4=1 5=1 6=432 7=48 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck1_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck1_relu61_relu6 mobilenetv20_features_linearbottleneck1_batchnormcudnnoff2_fwd 0=12 1=1 5=1 6=576
Split                    splitncnn_0              1 2 mobilenetv20_features_linearbottleneck1_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck1_batchnormcudnnoff2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck1_batchnormcudnnoff2_fwd_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck2_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck1_batchnormcudnnoff2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck2_relu60_relu6 0=72 1=1 5=1 6=864 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck2_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck2_relu60_relu6 mobilenetv20_features_linearbottleneck2_relu61_relu6 0=72 1=3 4=1 5=1 6=648 7=72 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck2_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck2_relu61_relu6 mobilenetv20_features_linearbottleneck2_batchnormcudnnoff2_fwd 0=12 1=1 5=1 6=864
BinaryOp                 mobilenetv20_features_linearbottleneck2_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck2_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck1_batchnormcudnnoff2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck2_elemwise_add0
Convolution              mobilenetv20_features_linearbottleneck3_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck2_elemwise_add0 mobilenetv20_features_linearbottleneck3_relu60_relu6 0=72 1=1 5=1 6=864 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck3_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck3_relu60_relu6 mobilenetv20_features_linearbottleneck3_relu61_relu6 0=72 1=3 3=2 4=1 5=1 6=648 7=72 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck3_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck3_relu61_relu6 mobilenetv20_features_linearbottleneck3_batchnormcudnnoff2_fwd 0=16 1=1 5=1 6=1152
Split                    splitncnn_1              1 2 mobilenetv20_features_linearbottleneck3_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck3_batchnormcudnnoff2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck3_batchnormcudnnoff2_fwd_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck4_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck3_batchnormcudnnoff2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck4_relu60_relu6 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck4_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck4_relu60_relu6 mobilenetv20_features_linearbottleneck4_relu61_relu6 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck4_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck4_relu61_relu6 mobilenetv20_features_linearbottleneck4_batchnormcudnnoff2_fwd 0=16 1=1 5=1 6=1536
BinaryOp                 mobilenetv20_features_linearbottleneck4_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck4_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck3_batchnormcudnnoff2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck4_elemwise_add0
Split                    splitncnn_2              1 2 mobilenetv20_features_linearbottleneck4_elemwise_add0 mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck5_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck5_relu60_relu6 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck5_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck5_relu60_relu6 mobilenetv20_features_linearbottleneck5_relu61_relu6 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck5_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck5_relu61_relu6 mobilenetv20_features_linearbottleneck5_batchnormcudnnoff2_fwd 0=16 1=1 5=1 6=1536
BinaryOp                 mobilenetv20_features_linearbottleneck5_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck5_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck4_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck5_elemwise_add0
Convolution              mobilenetv20_features_linearbottleneck6_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck5_elemwise_add0 mobilenetv20_features_linearbottleneck6_relu60_relu6 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck6_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck6_relu60_relu6 mobilenetv20_features_linearbottleneck6_relu61_relu6 0=96 1=3 3=2 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck6_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck6_relu61_relu6 mobilenetv20_features_linearbottleneck6_batchnormcudnnoff2_fwd 0=32 1=1 5=1 6=3072
Split                    splitncnn_3              1 2 mobilenetv20_features_linearbottleneck6_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck6_batchnormcudnnoff2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck6_batchnormcudnnoff2_fwd_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck7_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck6_batchnormcudnnoff2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck7_relu60_relu6 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck7_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck7_relu60_relu6 mobilenetv20_features_linearbottleneck7_relu61_relu6 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck7_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck7_relu61_relu6 mobilenetv20_features_linearbottleneck7_batchnormcudnnoff2_fwd 0=32 1=1 5=1 6=6144
BinaryOp                 mobilenetv20_features_linearbottleneck7_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck7_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck6_batchnormcudnnoff2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck7_elemwise_add0
Split                    splitncnn_4              1 2 mobilenetv20_features_linearbottleneck7_elemwise_add0 mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck8_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck8_relu60_relu6 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck8_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck8_relu60_relu6 mobilenetv20_features_linearbottleneck8_relu61_relu6 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck8_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck8_relu61_relu6 mobilenetv20_features_linearbottleneck8_batchnormcudnnoff2_fwd 0=32 1=1 5=1 6=6144
BinaryOp                 mobilenetv20_features_linearbottleneck8_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck8_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck7_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck8_elemwise_add0
Split                    splitncnn_5              1 2 mobilenetv20_features_linearbottleneck8_elemwise_add0 mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck9_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck9_relu60_relu6 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck9_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck9_relu60_relu6 mobilenetv20_features_linearbottleneck9_relu61_relu6 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck9_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck9_relu61_relu6 mobilenetv20_features_linearbottleneck9_batchnormcudnnoff2_fwd 0=32 1=1 5=1 6=6144
BinaryOp                 mobilenetv20_features_linearbottleneck9_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck9_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck8_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck9_elemwise_add0
Convolution              mobilenetv20_features_linearbottleneck10_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck9_elemwise_add0 mobilenetv20_features_linearbottleneck10_relu60_relu6 0=192 1=1 5=1 6=6144 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck10_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck10_relu60_relu6 mobilenetv20_features_linearbottleneck10_relu61_relu6 0=192 1=3 4=1 5=1 6=1728 7=192 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck10_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck10_relu61_relu6 mobilenetv20_features_linearbottleneck10_batchnormcudnnoff2_fwd 0=48 1=1 5=1 6=9216
Split                    splitncnn_6              1 2 mobilenetv20_features_linearbottleneck10_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck10_batchnormcudnnoff2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck10_batchnormcudnnoff2_fwd_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck11_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck10_batchnormcudnnoff2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck11_relu60_relu6 0=288 1=1 5=1 6=13824 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck11_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck11_relu60_relu6 mobilenetv20_features_linearbottleneck11_relu61_relu6 0=288 1=3 4=1 5=1 6=2592 7=288 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck11_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck11_relu61_relu6 mobilenetv20_features_linearbottleneck11_batchnormcudnnoff2_fwd 0=48 1=1 5=1 6=13824
BinaryOp                 mobilenetv20_features_linearbottleneck11_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck11_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck10_batchnormcudnnoff2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck11_elemwise_add0
Split                    splitncnn_7              1 2 mobilenetv20_features_linearbottleneck11_elemwise_add0 mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck12_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck12_relu60_relu6 0=288 1=1 5=1 6=13824 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck12_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck12_relu60_relu6 mobilenetv20_features_linearbottleneck12_relu61_relu6 0=288 1=3 4=1 5=1 6=2592 7=288 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck12_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck12_relu61_relu6 mobilenetv20_features_linearbottleneck12_batchnormcudnnoff2_fwd 0=48 1=1 5=1 6=13824
BinaryOp                 mobilenetv20_features_linearbottleneck12_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck12_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck11_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck12_elemwise_add0
Convolution              mobilenetv20_features_linearbottleneck13_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck12_elemwise_add0 mobilenetv20_features_linearbottleneck13_relu60_relu6 0=288 1=1 5=1 6=13824 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck13_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck13_relu60_relu6 mobilenetv20_features_linearbottleneck13_relu61_relu6 0=288 1=3 3=2 4=1 5=1 6=2592 7=288 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck13_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck13_relu61_relu6 mobilenetv20_features_linearbottleneck13_batchnormcudnnoff2_fwd 0=80 1=1 5=1 6=23040
Split                    splitncnn_8              1 2 mobilenetv20_features_linearbottleneck13_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck13_batchnormcudnnoff2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck13_batchnormcudnnoff2_fwd_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck14_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck13_batchnormcudnnoff2_fwd_splitncnn_1 mobilenetv20_features_linearbottleneck14_relu60_relu6 0=480 1=1 5=1 6=38400 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck14_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck14_relu60_relu6 mobilenetv20_features_linearbottleneck14_relu61_relu6 0=480 1=3 4=1 5=1 6=4320 7=480 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck14_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck14_relu61_relu6 mobilenetv20_features_linearbottleneck14_batchnormcudnnoff2_fwd 0=80 1=1 5=1 6=38400
BinaryOp                 mobilenetv20_features_linearbottleneck14_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck14_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck13_batchnormcudnnoff2_fwd_splitncnn_0 mobilenetv20_features_linearbottleneck14_elemwise_add0
Split                    splitncnn_9              1 2 mobilenetv20_features_linearbottleneck14_elemwise_add0 mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_1
Convolution              mobilenetv20_features_linearbottleneck15_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_1 mobilenetv20_features_linearbottleneck15_relu60_relu6 0=480 1=1 5=1 6=38400 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck15_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck15_relu60_relu6 mobilenetv20_features_linearbottleneck15_relu61_relu6 0=480 1=3 4=1 5=1 6=4320 7=480 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck15_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck15_relu61_relu6 mobilenetv20_features_linearbottleneck15_batchnormcudnnoff2_fwd 0=80 1=1 5=1 6=38400
BinaryOp                 mobilenetv20_features_linearbottleneck15_elemwise_add0 2 1 mobilenetv20_features_linearbottleneck15_batchnormcudnnoff2_fwd mobilenetv20_features_linearbottleneck14_elemwise_add0_splitncnn_0 mobilenetv20_features_linearbottleneck15_elemwise_add0
Convolution              mobilenetv20_features_linearbottleneck16_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck15_elemwise_add0 mobilenetv20_features_linearbottleneck16_relu60_relu6 0=480 1=1 5=1 6=38400 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     mobilenetv20_features_linearbottleneck16_conv1_fwd 1 1 mobilenetv20_features_linearbottleneck16_relu60_relu6 mobilenetv20_features_linearbottleneck16_relu61_relu6 0=480 1=3 4=1 5=1 6=4320 7=480 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              mobilenetv20_features_linearbottleneck16_conv2_fwd 1 1 mobilenetv20_features_linearbottleneck16_relu61_relu6 mobilenetv20_features_linearbottleneck16_batchnormcudnnoff2_fwd 0=160 1=1 5=1 6=76800
Convolution              hybridsequential0_conv0_fwd 1 1 mobilenetv20_features_linearbottleneck16_batchnormcudnnoff2_fwd hybridsequential0_relu0_fwd 0=128 1=1 5=1 6=20480 9=1
DeconvolutionDepthWise   hybridsequential0_conv1_fwd 1 1 hybridsequential0_relu0_fwd hybridsequential0_relu1_fwd 0=128 1=4 3=2 4=1 5=1 6=2048 7=128 9=1
Convolution              hybridsequential0_conv2_fwd 1 1 hybridsequential0_relu1_fwd hybridsequential0_relu2_fwd 0=128 1=1 5=1 6=16384 9=1
DeconvolutionDepthWise   hybridsequential0_conv3_fwd 1 1 hybridsequential0_relu2_fwd hybridsequential0_relu3_fwd 0=128 1=4 3=2 4=1 5=1 6=2048 7=128 9=1
Convolution              hybridsequential0_conv4_fwd 1 1 hybridsequential0_relu3_fwd hybridsequential0_relu4_fwd 0=128 1=1 5=1 6=16384 9=1
DeconvolutionDepthWise   hybridsequential0_conv5_fwd 1 1 hybridsequential0_relu4_fwd hybridsequential0_relu5_fwd 0=128 1=4 3=2 4=1 5=1 6=2048 7=128 9=1
Convolution              hybridsequential0_conv6_fwd 1 1 hybridsequential0_relu5_fwd hybridsequential0_relu6_fwd 0=128 1=1 5=1 6=16384 9=1
Convolution              hybridsequential0_conv7_fwd 1 1 hybridsequential0_relu6_fwd hybridsequential0_conv7_fwd 0=17 1=1 6=2176
